# Задание №1.
s=[1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1]
count = 0
for i in s:
    if i == 1:
      count += 1
print("Количество единиц в списке:", count)

# Задание №2.
s=[1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1]
print("Количество нулей в списке:", s.count(0))

# Задание №3.1.
s=[10, 25, 14, 11, 32, 21, 34, 42, 45, 67, 43, 32]
summa = 0
quantity = len(s)
for i in s:
    summa += i
print("Среднее арифметическое списка:", summa/quantity)

# Задание №3.2.
s=[10, 25, 14, 11, 32, 21, 34, 42, 45, 67, 43, 32]
print("Среднее арифметическое списка:", sum(s)/len(s))
